#include <stdio.h>
#include <math.h>

int main() {
    int x1, y1, x2, y2;
    double dx, dy, length;
    
    printf("Введіть координати початку вектора (x1, y1): ");
    scanf("%d %d", &x1, &y1); //введення координат вектора
    
    printf("Введіть координати кінця вектора (x2, y2): ");
    scanf("%d %d", &x2, &y2); //введення координат вектора
    
    dx = x2 - x1; //обчислення різниці координат вектора
    dy = y2 - y1; //обчислення різниці координат вектора
    
    length = sqrt(dx * dx + dy * dy); //обчислення довжини вектора
    
    printf("Довжина вектора: %.6f\n", length); //виведення результату з точнісю до 6 знаків після коми (%.6f)
    
    return 0;
}
