#include <stdio.h>
#include <math.h>

// Функція для обчислення кількості чисел із p розрядів, де три однакові цифри не стоять поруч
int countNumbers(int p) {
    
    // Застосовуємо формулу: 2^p - (p - 2), яка подана у теоретичних відомостях до практичного завдання №3 
    return pow(2, p) - (p - 2); 
    /* використала формулу 2^p для обчислення загальної кількості можливих чисел з p розрядів, 
    використовуючи цифри 5 та 9, бо для кожного розряду ми можемо вибрати одну з двох цифр: 5 або 9. 
    Таким чином, загальна кількість можливих чисел буде 2^p. Ця кількість включає в себе такі числа, де три однакові цифри можуть стояти поруч. 
    Варто врахувати це обмеження. Для цього розглядаємо можливі позиції, на яких можуть стояти три однакові цифри. 
    Ці позиції не можуть бути першою та останньою позиціями, оскільки там немає інших позицій для розташування третьої однакової цифри поруч. 
    Тому кількість способів вибрати такі позиції дорівнює (p - 2).*/
}

int main() {
    int p;
    printf("Введіть розмір числа (p ≤ 30): ");
    scanf("%d", &p); //зчитування кількості розрядів

    if (p <= 0 || p > 30) { //перевірка, чи входить введене число в діапазон від 1 до 30, бо в умові вказано, що число має бути менше або дорівнювати 30
        printf("Некоректний ввід. Розмір числа має бути в межах [1, 30].\n");
        return 1; // Повертаємо ненульове значення, якщо число не входить в діапазон від 1 до 30
    }

    int result = countNumbers(p); 
    /*присвоєння змінній result значення, яке обрахувала функція countNumbers 
    (кількість чисел із p розрядів, де три однакові цифри не стоять поруч)*/
  
    printf("Кількість чисел із %d розрядів: %d\n", p, result); //виведення результату
    return 0;
}




