#include <stdio.h>

/*функція для підрахунку кількості чисел із заданою кількістю розрядів. Функція, яка рахує кількість чисел із заданою кількістю розрядів n. 
Ця функція використовує умовні оператори if та else if для обробки особливих випадків розрядів 1 і 2. 
У випадку, коли розрядів більше 2, функція використовує побітовий зсув << для обчислення 2^(р-1).*/
int countNumbers(int n) {
    if (n == 1) {
        return 2; //для розряду 1 можна сформувати числа 5 і 9
    } else if (n == 2) {
        return 3; //для розряду 2 можна сформувати числа 59, 95 і 99
    } else {
        /*для розрядів більше 2, можна використовувати лише 5 або 9 в кожному розряді, оскільки не можна мати три однакові цифри поруч.
        Тому кількість можливих чисел буде дорівнювати 2^(р-1).*/
        return 1 << (n - 1); //використання побітового зсуву вліво для обчислення 2^(р-1)
    }
}

int main() {
    int r;
    printf("Введіть кількість розрядів (р): ");
    scanf("%d", &r); //зчитування кількості розрядів

    int result = countNumbers(r);
    printf("Кількість чисел із %d розрядів: %d\n", r, result); //виведення результату

    return 0;
}
