#include <stdio.h>

int main() {
    int t1, t2, t3;  // змінні, які показують час, необхідний кожному з трьох гостів для з'їдання 1 пирога

    printf("Введіть 3 значення: \n");
    scanf("%d", &t1); //зчитування часу першого гостя
    scanf("%d", &t2); //зчитування часу другого гостя
    scanf("%d", &t3); //зчитування часу третьго гостя
  
    // Обчислення середнього часу для з'їдання 1 пирога гостями
    float average_time = (float)(t1 + t2 + t3) / 3; //оскільки введені нами значення були типу int, для переведення у тип чисел з плаваючою точкою я використала таку штуку, як (float)
    average_time/=3;

    //виведення обчисленого результату
    printf("Час, необхідний для з'їдання пирога: %.2f годин(и). \n", average_time); //використала %.2f для того, щоб було 2 знаки після крапки

    return 0;
}
