#include <stdio.h>
#include <math.h> //підключення бібліотеки з математичними формулами

int findIntersectionPoints(int x1, int y1, int r1, int x2, int y2, int r2) { /*ця функція обчислює кількість точок перетину між двома колами
    Параметри функції:
    x1 (int): x-координата центру першого кола
    y1 (int): y-координата центру першого кола
    r1 (int): радіус першого кола
    x2 (int): x-координата центру другого кола
    y2 (int): y-координата центру другого кола
    r2 (int): радіус другого кола
    Результат:
    int: кількість точок перетину
         -1, якщо точок перетину нескінченно багато*/
    
    double distance = sqrt(pow(x2 - x1, 2) + pow(y2 - y1, 2)); //обчислення відстані між центрами кіл за формулою √((x2 - x1)² + (y2 - y1)²)
    
    if (distance == 0 && r1 == r2) { /*перевірка кіл на концентричність (концентричні кола - центрами
    такі, у яких спільний центр і однакові радіуси*/
        return -1;  //повертає такий результат, якщо раптом вийде нескінченна кількість точок перетину
    }
    
    if (distance > r1 + r2 || distance < fabs(r1 - r2)) { //перевірка, чи не перетинаються кола
        return 0;  //повертає такий результат, якщо немає точок перетину
    }
    
    if (distance < r1 + r2 && distance > fabs(r1 - r2)) { //перевірка, чи не міститься одне коло в іншому
        return 2;  //повертає такий результат, якщо 2 точки перетину
    }
    
    //якщо кола дотикаються ззовні або зсередини
    return 1;  //повертає такий результат, якщо 1 точка перетину
}

int main() {
    int x1, y1, r1, x2, y2, r2; //змінні, які містять параметри кіл
    printf("Введіть координати та радіуси двох кіл (х, у, r): ");
    scanf("%d %d %d %d %d %d", &x1, &y1, &r1, &x2, &y2, &r2); //зчитування параметрів кіл
    
    int intersectionPoints = findIntersectionPoints(x1, y1, r1, x2, y2, r2); /*змінній intersectionPoints
    присвоюється значення, яке обраховує функція findIntersectionPoints, тобто кількість точок перетину між двома колами*/ 
    
    printf("Кількість точок перетину: %d\n", intersectionPoints); //виведення результату
    
    return 0;
}
