#include <stdio.h>

int main() {
    unsigned int n; /*змінна, в якій буде зберігатися введене натуральне число n. 
    Використовується тип unsigned int, оскільки натуральні числа не мають від'ємних значень.*/
    int count = 0;

    printf("Введіть натуральне число n (1 < n < 150): ");
    scanf("%u", &n); //зчитування числа

    if (n <= 1 || n >= 150) { //перевірка, чи входить число в діапазон від 1 до 150
        printf("Некоректне введення. Будь ласка, введіть число в межах 1 < n < 150.\n");
        return 1;
    }

    for (unsigned int m = 1; m <= n; m++) { //перебір всіх можливих значень m від 1 до n
        if (n % m == n / m) { // Перевірка умови, що n % m == n / m
            count++;  // Якщо умова виконується, збільшуємо лічильник (це змінна count)
        }
    }

    printf("Кількість рівних дільників числа %u: %d\n.", n, count); //виведення результату

    return 0;
}
