#include <stdio.h>

// функція для обчислення найбільшого спільного дільника (НСД) двох чисел. Функція обчислює найбільший спільний дільник (НСД) двох чисел за допомогою рекурсії і алгоритму Евкліда
int findGCD(int a, int b) {
    if (b == 0) {
        return a;
    }
    return findGCD(b, a % b);
}

// функція для обчислення найменшого спільного кратного (НСК) двох чисел. Використовує результат НСД для обчислення найменшого спільного кратного (НСК) двох чисел
int findLCM(int a, int b) {
    int gcd = findGCD(a, b);
    return (a * b) / gcd;
}

int main() {
    int n;  // кількість чисел, для яких буде шукатися НСК
    printf("Введіть кількість чисел: ");
    scanf("%d", &n); //зчитування кількості чисел

    int numbers[20];  // масив для збереження заданих чисел
    printf("Введіть %d натуральних чисел, розділених пробілом: ", n);
    for (int i = 0; i < n; i++) {
        scanf("%d", &numbers[i]); //зчитування масиву
    }

    int lcm = numbers[0];  // початкове значення для НСК - ініціалізуємо змінну lcm значенням першого числа з масиву numbers
    for (int i = 1; i < n; i++) {
        lcm = findLCM(lcm, numbers[i]); //викликаємо функцію findLCM для обчислення НСК з поточним значенням lcm та наступним числом з масиву
    }

    printf("Найменше спільне кратне заданих чисел: %d\n.", lcm); //виведення результату

    return 0;
}

