#include <stdio.h>
#include <stdlib.h>

//функція для визначення мінімальної кількості кроків
int minSteps(int x, int y) {
    int steps = 0;  //змінна для підрахунку кількості кроків
    int diff = y - x; //різниця між початковим і кінцевим значеннями
    int sign = (diff >= 0) ? 1 : -1;  //це знак різниці (+1 для додатньої різниці, -1 для від'ємної різниці). Він використовується для врахування напрямку переходу
    diff = abs(diff);  //модуль різниці

    int k = 1; //початкова довжина поточного кроку
    int count = 0; //лічильник для відстеження кількості виконаних кроків
    while (diff > 0) { //віднімається довжина поточного кроку з різниці і збільшується лічильник кроків. Це повторюється, доки різниця не стане недодатною.
        diff -= k; //віднімаємо довжину поточного кроку з різниці
        count++; //збільшуємо лічильник кроків

        if (count == 2) { //коли лічильник досягає значення 2, довжина кроку збільшується на 1, щоб врахувати всі можливі довжини кроків (на 1 більше, на 1 менше і такий самий, як попередній крок). Після цього лічильник скидається до значення 0
            k++; //якщо виконано два кроки, збільшуємо довжину кроку на 1
            count = 0;  //скидаємо лічильник
        }

        steps++; //збільшуємо лічильник кроків
    }

    return steps; //повертаємо кількість кроків
}

int main() {
    int x, y;
    printf("Введіть значення x: ");
    scanf("%d", &x); //зчитування значення з клавіатури
    printf("Введіть значення y: ");
    scanf("%d", &y); //зчитування значення з клавіатури

    int steps = minSteps(x, y); //викликається функція minSteps для визначення мінімальної кількості кроків
    printf("Мінімальна кількість кроків для переходу від %d до %d: %d\n", x, y, steps); //виведення результату

    return 0;
}
