#include<stdio.h>
#include<string.h>
#include<ctype.h> //підключила цю бібліотеку, бо вона містить функції для переведення символів у верхній/нижній регістр та перевірки типу символів

int factorial(int n) { //функція для обчислення факторіалу числа
    if (n <= 1)
        return 1;
    else
        return n * factorial(n - 1);
}

int countAnagrams(char word[]) { //функція для підрахунку кількості анаграм
    int len = strlen(word); //обчислення довжини слова 
    int frequency[26] = {0}; /*оголошення масиву frequency розміром 26 (відповідає кількості латинських букв), в якому 
    початково всі значення ініціалізуються нулем. Цей масив використовується для зберігання частоти кожної букви в слові*/
    int totalAnagrams = factorial(len); //змінна totalAnagrams є факторіалом довжини слова. Це початкова кількість анаграм перед врахуванням повторень
    
    for (int i = 0; i < len; i++) { //розрахунок частоти кожної букви в слові
        char c = toupper(word[i]); /*я використала функцію toupper з бібліотеки ctype.h для перетворення кожної 
        букви на велику перед обчисленням її частоти. Це дозволяє правильно розрахувати кількість анаграм, 
        враховуючи регістр букв введеного слова (наприклад SOLO i SoLo)*/
        frequency[c - 'A']++; /*збільшення значення відповідного елементу масиву frequency, використовуючи індекс, 
        обчислений як c - 'A'. Це збільшує частоту даної букви в слові*/

    }

    for (int i = 0; i < 26; i++) { //розрахунок добутку факторіалів кількостей входжень кожної букви
        if (frequency[i] > 1) { //перевірка, чи частота даної букви є більше 1, що означає, що буква повторюється у слові
            totalAnagrams /= factorial(frequency[i]); /*розрахунок добутку факторіалів кількостей входжень кожної букви. 
            Значення frequency[i] використовується для обчислення факторіалу, і результат ділиться на totalAnagrams.*/
        }
    }

    return totalAnagrams; //повертає число типу int, яке є кількістю анаграм
}

int main() {
    char word[15]; //оголошення масиву, який буде використовуватися для зберігання введеного слова
    printf("Введіть слово: ");
    scanf("%s", word); //зчитування введеного слова у масив word

    int anagramCount = countAnagrams(word); //змінна anagramCount приймає значення кількості анаграм, яке обраховує функція countAnagrams(word) 
    printf("Кількість анаграм: %d\n", anagramCount); //виведення результату

    return 0;
}
